package com.hanyun.scm.api.consts;

/**
 * <pre>
 *                             _ooOoo_
 *                            o8888888o
 *                            88" . "88
 *                            (| -_- |)
 *                            O\  =  /O
 *                         ____/`---'\____
 *                       .'  \\|     |//  `.
 *                      /  \\|||  :  |||//  \
 *                     /  _||||| -:- |||||-  \
 *                     |   | \\\  -  /// |   |
 *                     | \_|  ''\---/''  |   |
 *                     \  .-\__  `-`  ___/-. /
 *                   ___`. .'  /--.--\  `. . __
 *                ."" '<  `.___\_<|>_/___.'  >'"".
 *               | | :  `- \`.;`\ _ /`;.`/ - ` : | |
 *               \  \ `-.   \_ __\ /__ _/   .-` /  /
 *          ======`-.____`-.___\_____/___.-`____.-'======
 *                             `=---='
 *          ^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^
 *
 *                     佛祖保佑        永无BUG
 *
 *          ^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^
 * </pre>
 * IdGenerateType
 * Date: 2016/12/7
 * Time: 下午5:20
 *
 * @author tianye@hanyun.com
 */
public enum IdGenerateType {
    GY("供应商"),
    GL("供应商类型"),
    CG("采购申请单"),
    CJ("采购计划单"),
    CD("采购订单"),
    CR("采购入库单"),
    CT("采购退货单"),
    RK("入库单"),
    CK("出库单"),
    DB("调拨单"),
    SH("收货单"),
    PR("盘点任务单"),
    PD("盘点单"),
    PC("盘点差异单"),
    YK("转仓单"),
    CZD("拆装单"),
    BS("报损单"),
    BY("报溢单"),
    PSD("配送单"),
    BHSQ("补货申请单"),
    WLFH("物流发货单"),
    YSRK("验收入库单"),
    HJ("货架编号");
    private String desc;

    IdGenerateType(String desc) {
        this.desc = desc;
    }

    public String getDesc() {
        return desc;
    }
}
